content-org/all-posts.en.org
#+hugo_base_dir: ../

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+options: author:nil

** DONE Running Oh-My-Zsh inside Spacemacs           :emacs:@programming:zsh:
   :PROPERTIES:
   :EXPORT_FILE_NAME: running-oh-my-zsh-inside-spacemacs.en.md
   :EXPORT_DATE: [2019-10-26 Sat 10:58]
   :END:
   When I start using [[http://spacemacs.org/][Spacemacs]], I was hoping there is a way to using my own configured [[https://ohmyz.sh/][zsh]]
   inside the Spacemacs workflow, after a look through the documentation, of
   course we can do it
   #+hugo: more
   First, we need to let Spacemacs load zsh when it setup ~shell~, and I found
   you can do a pop-up buffer style with 30% of the current height from the
   bottom.

   So in ~.spacemacs~ we can set this in ~dotspacemacs-configure-layers~:
   #+begin_src emacs-lisp
     (shell :variables
            shell-default-term-shell "/bin/zsh" ;; find your zsh path using `$ whereis zsh`
            shell-default-height 30
            shell-default-position 'bottom)
   #+end_src
   This change is the basic setup, *but since I enabled ~vi~ key bindings in my
   zsh, it starts conflicts with Spacemacs [[https://github.com/emacs-evil/evil][evil-mode]].* after a play around with different
   settings, I found the best option for me is to disable the evil-mode inside
   [[https://www.emacswiki.org/emacs/AnsiTerm][ansi-term]].

   Add following code in ~dotspacemacs/user-config~:
   #+begin_src emacs-lisp
     (evil-set-initial-state 'term-mode 'emacs)
   #+end_src
   This change allows us navigation in ansi-term, but we can not editing
   anything in the input line. We need to do *one more change*:
   #+begin_src emacs-lisp
     (evil-set-initial-state 'term-mode 'emacs) ;; turn off evil-mode for ansi-term
     (setq term-char-mode-point-at-process-mark nil) ;; allow editing in normal mode
   #+end_src
   After ~SPC f e R~, we can now using zsh inside Spacemacs
**** Reference
    - [[https://github.com/syl20bnr/spacemacs/issues/8642][syl20bnr/spacemacs#8642 Cannot edit shell commands in normal mode.]]
    - [[https://github.com/syl20bnr/spacemacs/tree/develop/layers/+tools/shell][spacemacs/layers/+tools/shell at develop · syl20bnr/spacemacs · GitHub]]
